InformationRegisters/КотировкиДень.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>КотировкиДень</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>ЦенаH</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаL</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаO</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЦенаC</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Value</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>25</v8:Digits>
							<v8:FractionDigits>6</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Volume</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Акция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Акции</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Catalogs/Акции.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>Акции</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
			<Owners>
				<xr:Item>Catalog.Контрагенты</xr:Item>
			</Owners>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тикер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипАкции</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ТипыАкций</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>УчетПоСтратегии</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидУчетаПоСтратегии</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидУчетаПоСтратегии</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗагружатьКурс</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ШагЦены</Name>
					<Type>
						<v8:TypeSet>cfg:DefinedType.ДенежныеСредстваЦена</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

CommonModules/ПолучитьИсториюЦен/Ext/Module.bsl
&НаСервере
Функция СформироватьСписокАкций() Экспорт
	СекцияРынка 	= "shares";
	КонецПериода 	= ТекущаяДата() - 86400;

	Запрос = Новый запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	Акции.Ссылка КАК Ссылка,
	|	Акции.Тикер КАК Тикер,
	|	Акции.ПометкаУдаления КАК ПометкаУдаления,
	|	Акции.ЗагружатьКурс КАК ЗагружатьКурс,
	|	КотировкиДеньСрезПоследних.Период КАК Период
	|ИЗ
	|	Справочник.Акции КАК Акции
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КотировкиДень.СрезПоследних КАК КотировкиДеньСрезПоследних
	|		ПО (Акции.Ссылка = КотировкиДеньСрезПоследних.Акция)
	|ГДЕ
	|	Акции.ПометкаУдаления = ЛОЖЬ
	|	И Акции.ЗагружатьКурс = ИСТИНА";
	РезультатЗапроса = Запрос.Выполнить();
		Если РезультатЗапроса.Пустой() Тогда
			Возврат Ложь;
		КонецЕсли;
		ТаблицаАкции = РезультатЗапроса.Выбрать();
		
	Пока  ТаблицаАкции.Следующий() Цикл
		КодИнструмента 	= ТаблицаАкции.Тикер;
		СсылкаАкция		= ТаблицаАкции.Ссылка;
		ДатаКонцаПериода = ТаблицаАкции.Период;
		Если ЗначениеЗаполнено(ДатаКонцаПериода) Тогда
			НачалоПериода =   ДатаКонцаПериода;
		Иначе
			НачалоПериода = '2000-01-01';
		КонецЕсли;
		РезультатЗагрузки = ЗагрузитьКотировкиДень(КодИнструмента, НачалоПериода, КонецПериода, СекцияРынка, СсылкаАкция);
		Если РезультатЗагрузки = Истина  Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Курс акции " + КодИнструмента + "загружен.";
			Сообщение.Сообщить();
		Иначе
			Прервать;
			
		КонецЕсли;               
		
	КонецЦикла;
	Возврат РезультатЗагрузки;
КонецФункции // СформироватьСписокАкций()





Функция ЗапросПолучитьДанные(АдресЗапроса, ПоляСДатами = "")
    
    HTTPСоединение = Новый HTTPСоединение("iss.moex.com");
    Запрос = Новый HTTPЗапрос("/iss/" + АдресЗапроса);
    Попытка
        Ответ = HTTPСоединение.Получить(Запрос);
        Если Ответ.КодСостояния <> 200 тогда
            Возврат Неопределено;
        КонецЕсли;
        Чтение = Новый ЧтениеJSON;
        Чтение.УстановитьСтроку(Ответ.ПолучитьТелоКакСтроку());
        Данные = ПрочитатьJSON(Чтение, Ложь, ПоляСДатами);
        Чтение.Закрыть();
    Исключение
        Возврат Неопределено;
    КонецПопытки;
    
    Возврат Данные;
    
КонецФункции

Функция ОчиститьДату(СтрДата)
    
    Возврат СтрЗаменить(СтрЗаменить(СтрЗаменить(СтрДата, "-", ""), " ", ""), ":", "");
    
КонецФункции

Функция ЗагрузитьКотировкиДень(КодИнструмента, НачалоПериода, КонецПериода, СекцияРынка, СсылкаАкция) Экспорт
    
    СтрокаЗапроса = "engines/stock/markets/"+СекцияРынка+"/securities/" + КодИнструмента + "/candles.json" +
    "?from=" + Формат(НачалоПериода, "ДФ=yyyy-MM-dd") +
    "&till=" + Формат(КонецПериода, "ДФ=yyyy-MM-dd") +
    "&interval=24" +
    "&start=";
    
    // получаем данные порциями по 500
    ТекущаяПозиция = 0;
    
    Пока Истина цикл
        
        Данные = ЗапросПолучитьДанные(СтрокаЗапроса + Формат(ТекущаяПозиция, "ЧГ=0"));
        
        Если Данные = Неопределено тогда
            Сообщение = Новый СообщениеПользователю();
            Сообщение.Текст = "Не удалось загрузить данные";
            Сообщение.Сообщить();
            Возврат Ложь;
        КонецЕсли;
        
        Если Данные.candles.data.Количество() = 0 тогда
            Возврат Истина;
        КонецЕсли;
        
        Для каждого Свеча из Данные.candles.data цикл
            
            ЗаписьКотировки = РегистрыСведений.КотировкиДень.СоздатьМенеджерЗаписи();
            ЗаписьКотировки.Период = ОчиститьДату(Свеча[6]);
			
            ЗаписьКотировки.Акция = СсылкаАкция;
            ЗаписьКотировки.ЦенаO = Свеча[0];
            ЗаписьКотировки.ЦенаC = Свеча[1];
            ЗаписьКотировки.ЦенаH = Свеча[2];
            ЗаписьКотировки.ЦенаL = Свеча[3];
            ЗаписьКотировки.Value = Свеча[4];
            ЗаписьКотировки.Volume = Свеча[5];
            ЗаписьКотировки.Записать();
            
        КонецЦикла;
        
        ТекущаяПозиция = ТекущаяПозиция + 500;
        
    КонецЦикла;
    
    Возврат Истина;
    
КонецФункции


//Пример КодИнструмента(Тикер) = "YNDX",   
//СекцияРынка = "shares" 
//id 	(int32)		NAME (string:45)	title (string:765)
//5		index		Индексы фондового рынка
//1		shares		Рынок акций
//2		bonds		Рынок облигаций
//4		ndm			Режим переговорных сделок
//29	otc			ОТС
//27	ccp			РЕПО с ЦК
//35	deposit		Депозиты с ЦК
//3		repo		Рынок сделок РЕПО
//28	qnv			Квал. инвесторы
//36	mamc		Мультивалютный рынок смешанных активов
//47	foreignshares	Иностранные ц.б.
//49	foreignndm	Иностранные ц.б. РПС
//33	moexboard	MOEX Board
//46	gcc			РЕПО с ЦК с КСУ
//54	credit		Рынок кредитов
//1015	nonresndm	Режим переговорных сделок (нерезиденты)
//1017	nonresrepo	Рынок РЕПО (нерезиденты)
//1019	nonresccp	Рынок РЕПО с ЦК (нерезиденты)
//23	standard	Standard
//25	classica	Classica  

//durations
//interval (int32)	duration (int32)	days (int32)	title (string:765)	hint (string:765)
//1		60		null	минута		1м
//10	600		null	10 минут	10м
//60	3600	null	час	1ч
//24	86400	null	день		1д
//7		604800	null	неделя		1н
//31	2678400	null	месяц		1М
//4		8035200	null	квартал	1К
